In [39]:
import pandas as pd
import numpy as np

In [4]:
# Series 객체
# merge() 예제 리스트 데이터셋
employee = [{'empno':1, 'ename':'kim', 'dept':1},
            {'empno':2, 'ename':'lee', 'dept':2},
            {'empno':3, 'ename':'park', 'dept':1},
            {'empno':4, 'ename':'song', 'dept':3},
            {'empno':5, 'ename':'min', 'dept':2} ]
dept=[{'dept':1, 'deptname':'관리직'},
      {'dept':2, 'deptname':'영업직'},
      {'dept':3, 'deptname':'개발직'} ]
info =[{'empno':1, 'addr':'서울시','phone':'010-1111-1111'},
       {'empno':3, 'addr':'부산시','phone':'010-2222-2222'},
       {'empno':2, 'addr':'광주시','phone':'010-3333-3333'},
       {'empno':5, 'addr':'광주시','phone':'010-4444-4444'},
       {'empno':4, 'addr':'광주시','phone':'010-5555-5555'} ]
emp = pd.DataFrame(employee)
dept = pd.DataFrame(dept)
info = pd.DataFrame(info)

m = pd.merge(emp, dept, how = 'inner') # 조건을 안줘도 공통된것을 알아서 찾아준다.
m2 = pd.merge(m, info, how = 'inner')
m2.drop(columns = ['empno'], inplace = True)
m2

  ename  dept deptname addr          phone
0   kim     1      관리직  서울시  010-1111-1111
1  park     1      관리직  부산시  010-2222-2222
2   lee     2      영업직  광주시  010-3333-3333
3   min     2      영업직  광주시  010-4444-4444
4  song     3      개발직  광주시  010-5555-5555

In [6]:
# str.contains()메서드를 사용하여 문자열의 조건 검색, 행을 추출
m3 = m2['ename'].str.contains('k') # ename 열에서 k를 포함하는것만 Series로 추출
print(m3, type(m3))

0     True
1     True
2    False
3    False
4    False
Name: ename, dtype: bool <class 'pandas.core.series.Series'>

In [7]:
m2[m3]

  ename  dept deptname addr          phone
0   kim     1      관리직  서울시  010-1111-1111
1  park     1      관리직  부산시  010-2222-2222

In [8]:
# deptname 이 영업직인 행만 추출
m4 = m2['deptname'].str.contains('영업직')
print(m2[m4])
# 'addr'가 '광주시'인 행만 추출
m4 = m2['addr'].str.contains('광주시')
print(m2[m4])

  ename  dept deptname addr          phone
2   lee     2      영업직  광주시  010-3333-3333
3   min     2      영업직  광주시  010-4444-4444
  ename  dept deptname addr          phone
2   lee     2      영업직  광주시  010-3333-3333
3   min     2      영업직  광주시  010-4444-4444
4  song     3      개발직  광주시  010-5555-5555

In [17]:
score_table = {'영어' : [10, 20, 30, 40 ,50],
               '수학' : [50, 40, 30, 20, 10]}
df1 = pd.DataFrame(score_table)
sr = df1['영어']
print(sr.sum())
print(sr.mean())
print(sr.median())
print(sr.max())
print(sr.min())
print(sr.std())
print(sr.var())
print(sr.count())
print(sr.describe())

150
30.0
30.0
50
10
15.811388300841896
250.0
5
count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
Name: 영어, dtype: float64

### 누락 데이터(결측치, NaN, NaT) 다루기

In [46]:
df = pd.read_csv('WHO_first9cols.csv')
df.count()
df2 = df[['Country', df.columns[-2]]]
df2

# print(pd.isnull(df2)) # 결측치는 True로 반환
# print(pd.notnull(df2)) # 결측치는 False로 반환
pd.isnull(df2).sum() # 결측치의 수
pd.isnull(df).sum() # 결측치의 수

Country                                                    0
CountryID                                                  0
Continent                                                  0
Adolescent fertility rate (%)                             25
Adult literacy rate (%)                                   71
Gross national income per capita (PPP international $)    24
Net primary school enrolment ratio female (%)             23
Net primary school enrolment ratio male (%)               23
Population (in thousands) total                           13
dtype: int64

In [62]:
# 결측치를 0으로 채우기
# df2
#df3 = df2.fillna(0)
#df3
df3 = df2.replace(np.nan, 0)
# df3 = df.replace(np.nan, 0)
# df3

In [63]:
print(df2.describe())
print(df3.describe())

       Net primary school enrolment ratio male (%)
count                                   179.000000
mean                                     85.698324
std                                      15.451212
min                                      11.000000
25%                                      79.500000
50%                                      90.000000
75%                                      96.000000
max                                     100.000000
       Net primary school enrolment ratio male (%)
count                                   202.000000
mean                                     75.940594
std                                      30.921123
min                                       0.000000
25%                                      73.000000
50%                                      89.500000
75%                                      96.000000
max                                     100.000000

In [66]:
# 결측치를 평균으로 채움 : 평균에 영향이 없음.
df4 = df2.fillna(df2.mean())
df4

                Country  Net primary school enrolment ratio male (%)
0           Afghanistan                                    85.698324
1               Albania                                    94.000000
2               Algeria                                    96.000000
3               Andorra                                    83.000000
4                Angola                                    51.000000
..                  ...                                          ...
197             Vietnam                                    96.000000
198  West Bank and Gaza                                    85.698324
199               Yemen                                    85.000000
200              Zambia                                    90.000000
201            Zimbabwe                                    87.000000

[202 rows x 2 columns]

In [76]:
# Series 객체의 index 사용 및 결측치 제어
index_table = ['tv', 'vtr', 'phone']
sr = pd.Series([10, 20, 30], index = index_table)
type(sr)
sr
sr.index
r = sr.index.str.contains('v')
sr[r]

tv     10
vtr    20
dtype: int64

In [85]:
sr2 = sr.append(pd.Series([40, 50, 60], index = ['audio', 'iron', 'notebook']))
sr2
sr3 = sr2.append(pd.Series([np.nan], index = ['aircon']))
print(sr3)
print(sr3.mean())

# l = np.array([np.nan, 1, 2, 3]) # np.nan과 연산 --> np.nan이 나옴
# print(l)
# print(l.mean()) Nan이 나옴

sr4 = sr3.fillna(0)
print(sr4)
print(sr4.mean())
sr5 = sr3.fillna(sr3.mean())
print(sr5)
print(sr5.mean())

tv          10.0
vtr         20.0
phone       30.0
audio       40.0
iron        50.0
notebook    60.0
aircon       NaN
dtype: float64
35.0
tv          10.0
vtr         20.0
phone       30.0
audio       40.0
iron        50.0
notebook    60.0
aircon       0.0
dtype: float64
30.0
tv          10.0
vtr         20.0
phone       30.0
audio       40.0
iron        50.0
notebook    60.0
aircon      35.0
dtype: float64
35.0

In [89]:
from numpy.random import seed
from numpy.random import rand
from numpy.random import randint

seed(42)

df = pd.DataFrame({ 'Weather' : ['cold', 'hot', 'cold', 'hot', 'cold', 'hot', 'cold'],
                   'Food' : ['soup', 'soup', 'icecream', 'chocolate', 'icecream', 'icecream', 'soup'],
                   'Price' : 10 * rand(7), 'Number' : randint(1, 9, 7)})
df

  Weather       Food     Price  Number
0    cold       soup  3.745401       8
1     hot       soup  9.507143       5
2    cold   icecream  7.319939       4
3     hot  chocolate  5.986585       8
4    cold   icecream  1.560186       8
5     hot   icecream  1.559945       3
6    cold       soup  0.580836       6

In [91]:
weather_group = df.groupby('Weather')
print(weather_group) # DataFrameGroupBy 객체

# DataFrameGroupBy 객체에는 객체를 나눈 기준과, 나눠진 그룹이 들어있다.
i = 0
for name, group in weather_group :
    i += 1
    print(i, name, '\n', group)
    print('\n', type(group))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000011D00465248>
1 cold
   Weather      Food     Price  Number
0    cold      soup  3.745401       8
2    cold  icecream  7.319939       4
4    cold  icecream  1.560186       8
6    cold      soup  0.580836       6

 <class 'pandas.core.frame.DataFrame'>
2 hot
   Weather       Food     Price  Number
1     hot       soup  9.507143       5
3     hot  chocolate  5.986585       8
5     hot   icecream  1.559945       3

 <class 'pandas.core.frame.DataFrame'>